# "Если число делится ТОЛЬКО на 2,
# то вывести текст "Число делится ТОЛЬКО на 2".
# Если ТОЛЬКО на 3, то вывести текст "Число делится ТОЛЬКО на 3".
# Если и на 2 и на 3 вывести текст "Число делится и на 2 и на 3".
# В других случаях вывести текст "Число НЕ делится ни на 2, ни на 3"

# value = input("введи число: ")
# value = int(value)
# if value % 2 == 0:
#   print("Число делится на 2")
# elif value % 3 == 0:
#   print("Число делится на 3")
# elif value % 2 == 0 and value % 3 == 0:
#   print("Число делится на 2 и на 3")
# else:
#   print('Число не делится ни на 2 ни на 3')
#
# #####################################################
#
# value = input("введи число: ")
# value = int(value)
# if value % 2 == 0 and value % 3 == 0:
#   print("Число делится на 2 и на 3")
# elif value % 2 == 0:
#   print("Число делится на 2")
# elif value % 3 == 0:
#   print("Число делится на 3")
# else:
#   print('Число не делится ни на 2 ни на 3')